# Changing column names

In [6]:
d={'Ojas':['Gupta','Sharma','Tikoo'],'Mahi':['Sangral','mehta','Dubey']}

In [7]:
d

{'Ojas': ['Gupta', 'Sharma', 'Tikoo'], 'Mahi': ['Sangral', 'mehta', 'Dubey']}

In [8]:
import pandas as pd

In [9]:
val=pd.DataFrame(d)

In [5]:
d

{'Ojas': ['Gupta', 'Sharma', 'Tikoo'], 'Mahi': ['Sangral', 'mehta']}

In [10]:
val

     Ojas     Mahi
0   Gupta  Sangral
1  Sharma    mehta
2   Tikoo    Dubey

In [13]:
val.rename_columns={'Ojas':'Avni','Mahi':'Mahak'}

<ipython-input-13-cb707ba591a2>:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  val.rename_columns={'Ojas':'Avni','Mahi':'Mahak'}

In [12]:
val

     Ojas     Mahi
0   Gupta  Sangral
1  Sharma    mehta
2   Tikoo    Dubey